latex/RecursivelyEnumerableSetsAndDegrees/RecursivelyEnumerableSetsAndDegrees.tex
% Created 2020-01-07 二 16:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{Robert I. Soare}
\date{\today}
\title{Recursively Enumerable Sets and Degrees: A Study of Computable Functions and Computably Generated Sets}
\hypersetup{
 pdfauthor={Robert I. Soare},
 pdftitle={Recursively Enumerable Sets and Degrees: A Study of Computable Functions and Computably Generated Sets},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents \clearpage
\section{Recursive Functions}
\label{sec:org0ffea22}
\subsection{Formal Definitions of Computable Functions}
\label{sec:orgc1a3b08}
\subsubsection{Primitive Recursive Functions}
\label{sec:org5192850}
\begin{definition}[]
The class of primitive recursive functions is the smallest class \(\calc\) of
functions closed under the following schema
\begin{enumerate}
\item the \tf{successor function}, \(\lambda x[x+1]\in\calc\)
\item the \tf{constant functions}, \(\lambda x_1\dots x_n[m]\in\calc\), \(0\le n,m\)
\item the \tf{identity functions}, \(\lambda x_1\dots x_n[x_i]\in\calc\), \(1\le
      i\le n\)
\item (Composition) If \(g_1,\dots,g_m,h\in\calc\), then
\begin{equation*}
f(x_1,\dots,x_n)=h(g_1(x_1,\dots,x_n),\dots,g_m(x_1,\dots,x_n))
\end{equation*}
is in \(\calc\) where \(g_1,\dots,g_m\) are functions of \(n\) variables and \(h\)
is a function of \(m\) variables
\item (Primitive Recursion) If \(g,h\in\calc\) and \(n\ge 1\) then \(f\in\calc\) where
\begin{gather*}
f(0,x_2,\dots,x_n)=g(x_2,\dots,x_n)\\
f(x_1+1,x_2,\dots,x_n)=h(x_1,f(x_1,\dots,x_n),x_2,\dots,x_n)\\
\end{gather*}
\end{enumerate}
\end{definition}


Hence a function is primitve recursive if there is a \tf{derivation}, namely
a sequence \(f_1,\dots,f_k=f\) s.t. for each \(f_i,i\le k\) is either an initial
function or obtained from 4 or 5.

A predicate (relation) is \tf{primitive recursive} if its characteristic
function is.
\subsubsection{Diagonalization and Partial Recursive Functions}
\label{sec:org8515379}
Although the primitive recursive functions include all the usual functions
from elementary number theory they fail to include \tf{all} computable
functions. Each derivation of a primitive recursive function is a finite
string of symbols from a fixed finite alphabet, and thus all derivations can
be effectively listed. Let \(f_n\) be the function corresponding to the \(n\)th
derivation in this listing. Then the function \(g(x)=f_x(x)+1\) cannot be
primitive recursive.

The same argument applies to any effective set of schemata which produces
only \tf{total} functions. Thus to obtain all computable functions we are
forced to consider computable \tf{partial} functions.

\begin{definition}[Kleene]
The class of \tf{partial recursive} (p.r.) functions is the least class
obtained by closing under schemata 1 through 5 for the primitive recursive
functions and the following schemata 6. A \tf{total recursive} function
(abbreviated \tf{recursive} function) is a partial recursive function which
is total.
\begin{enumerate}
\setcounter{enumi}{5}
\item (Unbounded Search) If \(\theta(x_1,\dots,x_n,y)\) is a partial
recursive function of \(n+1\) variables, and 
\begin{align*}
\psi(x_1,\dots,x_n)=\mu y[\theta&(x_1,\dots,x_n,y)\downarrow=0\\
&\wedge (\forall z\le y)[\theta(x_1,\dots,x_n,z)\downarrow]]
\end{align*}
\end{enumerate}
\end{definition}
\begin{definition}[]
A relation \(R\subseteq \omega^n,n\ge 1\) is \tf{recursive} (\tf\{primitive
recursive, has property \} \(P\)) if its characteristic function \(\chi_R\) is
recursive (primitive recursive) where \(\chi_R(x_1\dots,x_n)=1\) if and only if
\((x_1,\dots,x_n)\in R\).
\end{definition}
\subsubsection{Turing Computable Functions}
\label{sec:org4550c29}
A \tf{Turing machine} \(M\) includes a two-way infinite \tf{tape} divided into
\tf{cells}, a \tf{reading head} which scans one cell of the tape at a time,
and a finite set of internal \tf{states} \(Q=\{q_0,\dots,q_n\},n\ge 1\). Each
cell is either blank (B) or has written on it the symbol 1. In a single step
the machine may simultaneously
\begin{enumerate}
\item change from one state to another
\item change the scanned symbol \(s\) to another symbol \(s'\in S=\{1,B\}\)
\item move the reading head one cell to the right (R) or left (L)
\end{enumerate}


The operation of \(M\) is controlled by a partial map 
\(\delta:Q\times S\to Q\times S\times\{R,L\}\)

The map \(\delta\) viewed as a finite set of quintuples is called a \tf\{Turing
program\}. The \tf{input} integer \(x\) is represented by a string of \(x+1\)
consecutive 1's.
