latex/RecursivelyEnumerableSetsAndDegrees/RecursivelyEnumerableSetsAndDegrees.tex
\subsection{The Basic Results}
\label{sec:org4da9d58}
\textbf{Church's Thesis} asserts that these functions coincide with the
intuitively computable functions. We shall accept Church's Thesis and from
now on shall use the terms "partial recursive" "Turing computable" and
"computable" interchangeably

\begin{definition}[]
Let \(P_e\) be the Turing program with code number (Gödel number) \(e\) 
(also called \textbf{index} \(e\)) in this
listing and let \(\varphi_e^{(n)}\) be the partial fucntions of \(n\) variables
computed by \(P_e\), where \(\varphi_e\) abbreviates \(\varphi_e^{(1)}\)
\end{definition}

\begin{lemma}[Padding Lemma]
Each partial recursive function \(\varphi_x\) has \(\aleph_0\) indices, and
furthermore for each \(x\) we can effectively find an infinite set \(A_x\) of
indices for the same partial function
\end{lemma}


\begin{proof}
For any program \(P_x\) mentioning internal states \(\{q_0,\dots,q_n\}\) add
extraneous instructions \(q_{n+1}Bq_{n+1}BR,q_{n+2}Bq_{n+2},BR,\dots\) to get
new programs for the same functions
\end{proof}
\begin{theorem}[Normal Form Theorem (Kleene]
There exist a predicate \(T(e,x,y)\) (called the \textbf{Kleene T-predicate}) and a
function \(U(y)\) which are recursive (indeed primitive recursive) s.t.
\begin{equation*}
\varphi_e(x)=U(\mu y T(e,x,y))
\end{equation*}
\end{theorem}

It follows from the Normal Form Theorem that every Turing computable partial
function is partial recursive.

\begin{theorem}[Enumeration Theorem]
There is a p.r. function of 2 variables \(\varphi_z^{(2)}(e,x)\) s.t.
\(\varphi_z^{(2)}(e,x)=\varphi_e(x)\). Indeed the Enumeration Theorem holds for
p.r. functions of \(n\) variables
\end{theorem}
\begin{proof}
Let \(\varphi_z^{(2)}(e,x)=U(\mu y T(e,x,y))\). For
\(\varphi_z^{(n)}(e,x_1,\dots,x_{n-1})\), by \(s\)-\(m\)-\(n\) theorem, 
\begin{equation*}
\varphi_z^{(n)}(e,\bar{x})=
\varphi_{s^2_{n-1}(z,e)}^{(n-1)}(\bar{x})
\end{equation*}
Thus we only need to make sure that \(s^2_{n-1}(z,e)\in A_e\), which can be
effectively found.
\end{proof}
\begin{theorem}[Parameter Theorem ($s$-$m$-$n$ Theorem)]
For every \(m,n\ge 1\) there exists a 1:1 recursive function \(s^m_n\) of \(m+1\)
variables s.t. for all \(x,y_1,y_2,\dots,y_m\)
\begin{equation*}
\varphi_{s^m_n(x,y_1,\dots,y_m)}^{(n)}=\lambda z_1,\dots,z_n
(\varphi_x^{(m+n)}(y_1,\dots,y_m,z_1,\dots,z_n))
\end{equation*}
\end{theorem}
\begin{proof}
\emph{(informal)}. For simplicity consider the case \(m=n=1\). The program
\(P_{s_1^1(x,y)}\) on input \(z\) first obtains \(P_x\) and then applies \(P_x\) to
input \((y,z)\)
\end{proof}

\begin{remark}
Here is an interesting question in \href{https://cs.stackexchange.com/questions/80837/is-smn-theorem-the-same-concept-as-currying}{StackExchange}
\end{remark}

The \(s\)-\(m\)-\(n\) theorem asserts that \(y\) may be treated as a fixed parameter
in the program \(P_{s(x,y)}\) which operate on \(z\) and furthermore that the
index \(s(x,y)\) of this program is effective in \(x\) and \(y\). A simple
application of the \$s\$-\$m\$-\(n\) theorem is the existence of a recursive
function \(f(x)\) s.t. \(\varphi_{f(x)}=2\varphi_x\). Let
\(\psi(x,y)=2\varphi_x(y)\). By Church's Thesis
\(\psi(x,y)=\varphi_e^{(2)}(x,y)\) for some \(e\). Let \(f(x)=s^1_1(e,x)\)

We let \(\la x,y\ra\) denote the image of \((x,y)\) under the standard pairing
function \(\frac{1}{2}(x^2+2xy+y^2+3x+y)\) which is a bijective recursive
function from \(\omega^2\to\omega\). Let \(\pi_1\) and \(\pi_2\) denote the inverse
functions \(\pi_1(\la x,y\ra)=x\)

\begin{definition}[]
We write \(\varphi_{e,s}(x)=y\) if \(x,y,e<s\) and \(y\) is the output
\(\varphi_e(x)\) in \(<s\) steps of the Turing machine \(P_e\). If such a \(s\)
exists we say \(\varphi_{e,s}(x)\) \tf{converges}, which we write as 
\(\varphi_{e,s}(x)\downarrow\), and \tf{diverges} (\(\varphi_{e,s}(x)\uparrow\)).
Similarly, we write \(\varphi_e(x)\downarrow\) if \(\varphi_{e,s}(x)\downarrow\)
for some \(s\)
\end{definition}

\begin{theorem}[]
\begin{enumerate}
\item The set \(\{\la e,x,s\ra:\varphi_{e,s}(x)\downarrow\}\) is recursive
\item The set \(\{\la e,x,y,s\ra:\varphi_{e,s}(x)=y\}\) is recursive
\end{enumerate}
\end{theorem}
\begin{proof}
From Church's Thesis since they are all computable
\end{proof}
