latex/RecursivelyEnumerableSetsAndDegrees/RecursivelyEnumerableSetsAndDegrees.tex
\subsection{Recursively Enumerable Sets and Unsolvable Problems}
\label{sec:orge38b491}
\begin{definition}[]
\begin{enumerate}
\item A set \(A\) is \textbf{recursively enumerable} (r.e.) if \(A\) is the domain of
some p.r. function
\item let the \(e\)th r.e. set be denoted by
\begin{equation*}
W_e=\dom{\varphi_e}=\{x:\varphi_e(x)\downarrow\}=\{x:(\exists y)T(e,x,y)\}
\end{equation*}
\item \(W_{e,s}=\dom{\varphi_{e,s}}\)
\end{enumerate}
\end{definition}

Note that \(\varphi_e(x)=x\) iff \((\exists s)[\varphi_{e,s}=y]\) and 
\(x\in W_e\) iff \((\exists s)(x\in W_{e,s})\)

\begin{definition}[]
Let \(K=\{x:\varphi_x(x)\text{ converges }\}=\{x:x\in W_x\}\)
\end{definition}
\begin{proposition}[]
\(K\) is r.e.
\end{proposition}
\begin{proof}
\(K\) is the domain of the following p.r. function
\begin{equation*}
\psi(x)=
\begin{cases}
x&\text{if } \varphi_x(x)\text{ converges},\\
\text{undefined}&\text{otherwise}
\end{cases}
\end{equation*}
Now \(\psi\) is p.r. by Church's Thesis since \(\psi(x)\) can be computed by
applying program \(P_x\) to input \(x\) and giving output \(x\) only if
\(\varphi(x)\) converges. Alternatively and more formally,
\(K=\dom{\theta}\) where \(\theta(x)=\varphi_z^{(2)}(x,x)\) for \(\varphi_z^{(2)}\)
the p.r. function defined in the Enumeration Theorem
\end{proof}
\begin{corollary}[]
\label{col1}
\(K\) is not recursive
\end{corollary}
\begin{proof}
If \(K\) had a recursive characteristic function \(\chi_K\) then the following
function would be recursive
\begin{equation*}
f(x)=
\begin{cases}
\varphi_x(x)+1&\text{if }x\in K\\
0&\text{if }x\not\in K
\end{cases}
\end{equation*}
However \(f\) cannot be recursive since \(f\neq\varphi_x\) for any \(x\)
\end{proof}
\begin{definition}[]
\(K_0=\{\la x,y\ra:x\in W_y\}\)
\end{definition}
\(K_0\) is p.r. but

\begin{proposition}[]
\(K_0\) is not recursive
\end{proposition}
\begin{proof}
\(x\in K\) iff \(\la x,x\ra\in K\)
\end{proof}

The \tf{halting problem} is to decide for arbitrary \(x\) and \(y\) whether
\(\varphi_x(y)\downarrow\). Corollary \ref{col1} asserts the unsolvability of the
halting problem.

\begin{definition}[]
\begin{enumerate}
\item \(A\) is a \tf{many-one reducible} (\tf{m-reducible}) to \(B\) (written
\(A\le_m B\)) if there is a recursive function \(f\) s.t. \(f(A)\subset B\) and
\(f(\bar{A})\subseteq\bar{B}\), i.e. \(x\in A\) iff \(f(x)\in B\)
\item \(A\) is \tf{one-one reducible} (\tf{1-reducible}) to \(B\) (\(A\le_1 B\)) if
\(A\le_m B\) by a 1:1 recursive function
\end{enumerate}
\end{definition}

The proof of corollary \ref{col1} established that \(K\le_1 K_0\) via the
function \(f(x)=\la x,x\ra\)
\begin{definition}[]
\begin{enumerate}
\item \(A\equiv_m B\) if \(A\le_m B\) and \(B\le_m A\)
\item \(A\equiv_1 B\) if \(A\le_1 B\) and \(B\le_1 A\)
\item \(\deg_m(A)=\{B:A\equiv_m B\}\)
\item \(\deg_1(A)=\{B:A\equiv_1 B\}\)
\end{enumerate}
\end{definition}

The equivalence classes under \(\equiv_m\) and \(\equiv_1\) are called the
\textbf{m-degrees} and \textbf{1-degrees} respectively

\begin{proposition}[]
If \(A\le_m B\) and \(B\) is recursive then \(A\) is recursive
\end{proposition}

\begin{proof}
\(\chi_A(x)=\chi_B(f(x))\)
\end{proof}

\begin{theorem}[]
\label{thm1}
\(K\le_1\text{Tot}:=\{x:\varphi_x\text{ is a total function}\}\)
\end{theorem}
\begin{proof}
Define the function
\begin{equation*}
\psi(x,y)=
\begin{cases}
1&\text{if } x\in K\\
\text{undefined} &\text{otherwise}
\end{cases}
\end{equation*}
By \(s\)-\(m\)-\(n\) theorem, there is a 1:1 recursive function \(f\) s.t.
\(\varphi_{f(x)}(y)=\psi(x,y)\). Choose \(e\) s.t. \(\varphi_e(x,y)=\psi(x,y)\) 
since \(\psi\) is p.r. and
define \(f(x)=s_1^1(e,x)\). Note that
\begin{align*}
&x\in K\Longrightarrow \varphi_{f(x)}=\lambda y[1]\Longrightarrow\varphi_{f(x)}\text{ total}
\Longrightarrow f(x)\in\text{Tot}\\
&x\not\in K\Longrightarrow\varphi_{f(x)}=\lambda y[\text{undefined}]\Longrightarrow
\varphi_{f(x)}\text{ not total}\Longrightarrow f(x)\not\in\text{Tot}
\end{align*}
\end{proof}

\begin{definition}[]
A set \(A\subseteq\omega\) is an \tf{index set} if for all \(x\) and \(y\)
\begin{equation*}
(x\in A\wedge\varphi_x=\varphi_y)\Longrightarrow y\in  A
\end{equation*}
\end{definition}

\begin{theorem}[]
If \(A\) is a nontrivial index set, i.e., \(A\neq \emptyset,\omega\), then either
\(K\le_1 A\) or \(K\le_1\overline{A}\)
\end{theorem}

\begin{proof}
Choose \(e_0\) s.t. \(\varphi_{e_0}(y)\) is undefined for all \(y\). If
\(e_0\in\overline{A}\), then \(K\le_1 A\) as follows. Since \(A\neq\emptyset\) we can
choose \(e_1\in A\). Now \(\varphi_{e_1}\neq\varphi_{e_0}\) because \(A\) is an
index set. By \(s\)-\(m\)-\(n\) theorem define a 1:1 recursive function \(f\)
s.t.
\begin{equation*}
\varphi_{f(x)}(y)=
\begin{cases}
\varphi_{e_1}(y)&x\in K\\
\text{undefined}&x\not\in K
\end{cases}
\end{equation*}
Now
\begin{align*}
&x\in K\Longrightarrow\varphi_{f(x)}=\varphi_{e_1}\Longrightarrow f(x)\in A\\
&x\not\in K\Longrightarrow\varphi_{f(x)}=\varphi_{e_0}\Longrightarrow
f(x)\in\overline{A}
\end{align*}
\end{proof}

It's possible that both \(K\le_1 A\) and \(K\le_1\overline{A}\) for an index set
\(A\), for example if \(A=\text{Tot}\)
\begin{corollary}[Rice's Theorem]
Let \(\calc\) be any class of partial recursive functions. Then
\(\{n:\varphi_n\in\calc\}\) is recursive iff \(\calc=\emptyset\) or \(\calc\) is
the set of all partial recursive functions
\end{corollary}
\begin{proof}
\(\calc\) is an index set and hence is trivial.
\end{proof}
\begin{definition}[]
\begin{align*}
&K_1=\{x:W_x\neq\emptyset\}\\
&\text{Fin}=\{x:W_x\text{ is finite}\}\\
&\text{Inf}=\omega-\text{Fin}=\{x:W_x\text{ is infinite}\}\\
&\text{Tot}=\{x:\varphi_x\text{ is total}\}=\{x:W_x=\omega\}\\
&\text{Con}=\{x:\varphi_x\text{ is total and constant}\}\\
&\text{Cof}=\{x:W_x\text{ is cofinite}\}\\
&\text{Rec}=\{x:W_x\text{ is recursive}\}\\
&\text{Ext}=\{x:\varphi_x\text{ is extendible to a total recursive function}\}\\
\end{align*}
\end{definition}
\begin{definition}[]
An r.e. set \(A\) is \textbf{1-complete} if \(W_e\le_1 A\) for every r.e. set \(W_e\)
\end{definition}

\(K_0\) is 1-complete because \(x\in W_e\) iff \(\la x,e\ra\in K_0\)

\begin{definition}[]
Let \(A\) \textbf{join} \(B\) written \(A\oplus B\) be
\begin{equation*}
\{2x:x\in A\}\cup\{2x+1:x\in B\}
\end{equation*}
\end{definition}
\begin{exercise}
\begin{enumerate}
\item \(A\le_m A\oplus B\) and \(B\le_M A\oplus B\)
\item if \(A\le_m C\) and \(B\le_m C\) then \(A\oplus B\le_m C\)
\end{enumerate}
\end{exercise}

\begin{exercise}
\(K\equiv_1 K_0\equiv_1 K_1\)
\end{exercise}
\begin{proof}
From proof of theorem \ref{thm1}, \(K\le_1 A\) for \(A=K_1,\text{con}\) or
\(\text{Inf}\).

\(K_0\le K\) for the same reason.

This method only concerns with the latter item.
\end{proof}

\begin{exercise}
\label{ex4.19}
Prove directly (without Rice's theorem) that \(K\le_1\text{Fin}\)
\end{exercise}
\begin{proof}
Let
\begin{equation*}
\varphi_{f(x)}(s)=
\begin{cases}
0&x\not\in K_s\\
\text{undefined}&x\in K_s
\end{cases}
\end{equation*}
where \(K_s=W_{e,s}\) for some \(e\) s.t. \(K=W_e\). If \(x\in K\), then
\(\dom{\varphi_{f(x)}}\) is finite
\end{proof}
\begin{exercise}
For any \(x\) show that \(\overline{K}\le_1\{y:\varphi_x=\varphi_y\}\) and
\(\overline{K}\le_1\{y:W_x=W_y\}\) 
\end{exercise}
\begin{proof}
Use the method of exercise \ref{ex4.19}. If \(x\not\in W_x\), then
\(\dom{\varphi_{f(x)}}=\omega\).
\end{proof}
\begin{exercise}
\(\text{Ext}\neq\omega\)
\end{exercise}
\begin{proof}
Use \(K\). If \(\psi(x)\) can be extended to a recursive function, then \(K\) would
be recursive.
\end{proof}

\begin{exercise}
\begin{enumerate}
\item Disjoints sets \(A\) and \(B\) are \textbf{recursively inseparable} if there is no
recursive set \(C\) s.t. \(A\subseteq C\) and \(C\cap B=\emptyset\). Show that
there exists disjoint r.e. sets which are recursively inseparable.
\item Give an alternative proof that \(\text{Ext}\neq\omega\)
\item For \(A\) and \(B\) as in part 1, prove that \(K\equiv_1 A\) and \(K\equiv_1 B\)
\end{enumerate}
\end{exercise}
\begin{proof}
\begin{enumerate}
\item Consider \(A=\{x:\varphi_x(x)=0\}\) and \(B=\{x:\varphi_x(x)=1\}\). If there
is a such recursive set \(C\) and its characteristic function is
\(\varphi_y\), then
\begin{equation*}
\varphi_y(x)=
\begin{cases}
1&\varphi_x(x)=0\\
1&\dots\\
0&\dots\\
0&\varphi_x(x)=1\\
\end{cases}
\end{equation*}
hence \(\varphi_y(y)\) leads to a contradiction.
\item corollary from 1.
\item The method are the same as \ref{thm1}
\end{enumerate}
\end{proof}

\begin{exercise}
A set \(A\) is \textbf{cylinder} if \((\forall B)[B\le_m A\Longrightarrow B\le_1 A]\)
\begin{enumerate}
\item Show that any index set is a cylinder
\item Show that any set of the form \(A\times\omega\) is a cylinder
\item Show that \(A\) is a cylinder iff \(A\equiv_1 B\times\omega\) for some set \(B\)
\end{enumerate}
\end{exercise}

\begin{proof}
\begin{enumerate}
\item If different \(x,y\in B\) and \(f(x)=f(y)\), we could just add redundent
computation and \(\varphi_{f(x)}=\varphi_{f(y)}\)
\item to make sure images are different by \(\omega\)
\item 
\end{enumerate}
\end{proof}

\begin{exercise}
Show that the partial recursive functions are not closed under \(\mu\), i.e.,
there is a p.r. function \(\psi\) s.t. \(\lambda x[\mu y[\psi(x,y)=0]]\) is not p.r.
\end{exercise}
\begin{proof}
\(\psi(x,y)=0\) if \(y=1\) or \(y=0\) and \(\varphi_x(x)\downarrow\).
\end{proof}
\begin{exercise}
If \(A\) is recursive and \(B,\overline{B}\) are each \(\neq\emptyset\), then
\(A\le_m B\)
\end{exercise}
\begin{proof}
choose elements \(b\in B\) and \(b'\in\overline{B}\). Then
\begin{equation*}
\psi_{f(x)}(s)=
\begin{cases}
b&x\in A\\
b'&x\not\in A\\
\end{cases}
\end{equation*}
\end{proof}
\begin{exercise}
Prove that \(\text{Inf}\equiv_1\text{Tot}\equiv_1\text{Con}\)
\end{exercise}
\begin{proof}
\(\text{Tot}\equiv_1\text{Con}\) is obvious. For \(\text{Inf}\le_1\text{Con}\),
define
\begin{equation*}
\psi(e,x)=
\begin{cases}
0&\text{if }(\exists y>x)[\varphi_e(y)\downarrow]\\
\uparrow&\text{otherwise}
\end{cases}
\end{equation*}
\end{proof}

\begin{exercise}
\(\text{Fin}\le_1\text{Cof}\)
\end{exercise}
\begin{proof}
\begin{equation*}
\varphi_{f(e)}(s)=
\begin{cases}
\uparrow&\text{if } W_{e,s+1}-W_{e,s}\neq\emptyset\\
0&\text{otherwise}
\end{cases}
\end{equation*}
\end{proof}
