latex/RecursivelyEnumerableSetsAndDegrees/RecursivelyEnumerableSetsAndDegrees.tex
\subsection{Recursive Permutation and Myhill's Isomorphism Theorem}
\label{sec:org72462dd}
\begin{definition}[]
\begin{enumerate}
\item A \textbf{recursive permutation} is a 1:1, recursive function from \(\omega\) to \(\omega\)
\item A property of set is \textbf{recursively invariant} if it's invariant under all
recursive permutation
\end{enumerate}
\end{definition}
Examples:
\begin{enumerate}
\item \(A\) is r.e.
\item \(A\) has cardinality n
\item \(A\) is recursive
\end{enumerate}


Properties that not recursively invariant:
\begin{enumerate}
\item \(2\in A\)
\item \(A\) contains the even integers
\item \(A\) is an index set
\end{enumerate}


\begin{definition}[]
A is \textbf{recursively isomorphic} to \(B\) (written \(A\equiv B\)) if there is a
recursive permutation \(p\) s.t. \(p(A)=B\)
\end{definition}

\begin{definition}[]
The equivalence classes under \(\equiv\) are called \textbf{recursive isomorphism types}
\end{definition}

\begin{theorem}[Myhill Isomorphism Theorem]
\(A\equiv B\Longleftrightarrow A\equiv_1 B\)
\end{theorem}
\begin{proof}
(\(\Longrightarrow\)) trivial.

(\(\Longleftarrow\)) Let \(A\le_1 B\) via \(f\) and \(B\le_1\) via \(g\). We define a
recursive permutation \(h\) by stages so that \(h(A)=B\). We let
\(h=\bigcup_sh_s\), where \(h_0=\emptyset\) and \(h_s\) is that portion of \(h\)
defined by the end of stage \(s\). Assume \(h_s\) is given so that in particular
we can effectively check for membership in \(\dom{h_s}\) and \(\ran{h_s}\) which
we both assume finite

\emph{Stage} \(s+1=2x+1\). Assume that \(h_s\) is \(1:1\), \(\dom{h_s}\) is finite and \(y\in
   A\) iff \(h_s(y)\in B\) for all \(y\in\dom{h_s}\).If \(h_s(x)\) is defined, do
nothing. Otherwise enumerate the set
\(\{f(x),f(h_s^{-1}f(x)),\dots,f(h_s^{-1}f)^n(x),\dots\}\) until the fist
element \(y\) not yet in \(\ran{h_s}\). Define \(h_{s+1}(x)=y\). \(y\) must exist
since \(f\) and \(h_s\) are \(1:1\) and \(x\not\in\dom{h_s}\)

\emph{Stage} \(s+1=2x+2\). Define \(h^{-1}(x)\) similarly with \(f,h_s,\dom{}\) and
\(\ran{}\) replaced by \(g,h_s^{-1},\ran{},\dom{}\) respectively
\end{proof}

\begin{definition}[]
A function \(f\) \textbf{dominates} a function \(g\) if \(f(x)\ge g(x)\) for almost every
(all but finitely many) \(x\in\omega\)
\end{definition}

\begin{exercise}[$\times$]
Prove that the primitive recursive permutations do not form a group under composition
\end{exercise}
\begin{proof}
Define \(g(x)=\mu yT(e,x,y)\). \(g\) dominates all primitive recursive functions
since \(y\ge U(y)\) for all \(y\). Suppose \(f\) is a primitive recursive
permutation and \(f(g(x))=x\) if \(x\) is even. Note that given \(y\) we can
primitively recursively compute whether there is an \(x\) s.t. \(g(x)=y\)
\end{proof}
\section{Fundamentals of Recursively Enumerable Sets and the Recursion Theorem}
\label{sec:org129927f}
\subsection{Equivalent Definitions of Recursively Enumerable Sets}
\label{sec:orgaa28ca0}
\end{document}